# HideActiveWorkPlane Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..HideActiveWorkPlane Method
View Class See Also
---
Hide the active work plane of the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void HideActiveWorkPlane()
```

Visual Basic
---
```text
Public Sub HideActiveWorkPlane
```

Visual C++
---
```text
public:
void HideActiveWorkPlane()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when there is no active sketch plane, or when an error occurs during setting the sketch plane visibility. |

# See Also
View Class
Autodesk.Revit.DB Namespace